IDEA StatiCa Open Model
ConnectionSetup.WeldEvaluationData Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Method of evaluation of stress in welds
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public WeldEvaluation WeldEvaluationData { get; set; }
Public Property WeldEvaluationData As WeldEvaluation
	Get
	Set
public:
property WeldEvaluation WeldEvaluationData {
	WeldEvaluation get ();
	void set (WeldEvaluation value);
}
Property Value
Type: WeldEvaluation
See Also
Reference
ConnectionSetup Class
IdeaRS.OpenModel Namespace